package com.kp.projectbookstore.data

import com.kp.projectbookstore.R
import com.kp.projectbookstore.models.Book
import com.kp.projectbookstore.models.User

object TestData {

    val books = listOf(
        Book(
            id = 1,
            title = "Воно",
            author = "Стівен Кінг",
            genre = "Жахи",
            price = 926.0,
            description = "Колись давно семеро підлітків лицем до лиця зіткнулися із невимовним Жахом — і змогли перемогти. Але багато років по тому істота, що не має імені, повертається, щоб помститися... Воно наче випірнуло з нічних кошмарів. Воно живиться страхом і ненавистю. Воно причаїлося всюди... Старі друзі мусять зустрітися з Ним і знову зазирнути у вічі справжньому жаху...",
            imageResId = R.drawable.book1,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 2,
            title = "Дюна",
            author = "Френк Герберт",
            genre = "Фантастика",
            price = 1020.0,
            description = "Меланж, або прянощі, — найцінніша і найрідкісніша речовина у всесвіті, яка може все: від подовження життя до сприяння міжзоряним подорожам. І знайти її можна лише на одній планеті — непривітному пустельному Арракісі. Той, хто володарює на Арракісі, контролює прянощі. А хто контролює прянощі — керує всесвітом. Коли Імператор позбавляє клан Харконненів звання правлячого і віддає цей титул Атрідам, Харконнени вбивають герцога Лето Атріда. Його син Пол і наложниця Джессіка тікають у пустелю. Щоб помститися за батька і відвоювати планету в Харконненів, Пол має здобути довіру фрименів — корінних мешканців Арракіса — і повести крихітну армію проти незліченних сил супротивника.",
            imageResId = R.drawable.book2,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 3,
            title = "Виживуть п'ятеро",
            author = "Голлі Джексон",
            genre = "Жахи",
            price = 1003.0,
            description = "Захопливий роман неперевершеної майстрині трилерів! На весняні канікули шестеро друзів вирушають на відпочинок у фургоні, який взяли напрокат. І наче все чудово і весело… хіба що кілька разів випадково звернули не туди… Та коли друзі розуміють, що застрягли десь у глушині без сигналу GPS і мобільного зв’язку, уже не так весело… А коли хтось прострілює їм усі шини та бензобак, стає зрозуміло — це геть не випадковість. Десь назовні в темряві за ними спостерігає убивця. А в когось у цьому фургоні є секрет, що вартує життя…",
            imageResId = R.drawable.book3,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 4,
            title = "Маленькі жінки",
            author = "Луїза Мей Олкот",
            genre = "Роман",
            price = 443.0,
            description = "«Маленькі жінки» — це захоплива історія чотирьох дівчат, рідних сестер, але абсолютно різних особистостей. Кожна з них має неповторний характер та інтереси. Під час Громадянської війни родина небагатого провінційного пастора Марча переживає складний період, очікуючи на повернення батька з фронту. Дівчата стають одна для одної надійною опорою у важкі часи. Сестри, попри війну, переживають радості, прикрощі та перше кохання. Вони продовжують дорослішати і вчаться цінувати справжні почуття, дружбу, сім'ю та любов.",
            imageResId = R.drawable.book4,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 5,
            title = "Тисяча пам'ятних поцілунків",
            author = "Тіллі Коул",
            genre = "Роман",
            price = 449.0,
            description = "Чи може кохання тривати вічно, попри перешкоди, відстань і час? Це можливо, якщо поєднуються дві половинки одного серця. Руну п’ять, він із батьками щойно переїхав із рідної Норвегії до маленького містечка американського штату Джорджія і дуже засмучений через це. Та відколи він знайомиться з дивакуватою сусідкою Поппі, його життя набуває яскравих кольорів і перетворюється на справжню пригоду. Поппі, виконуючи заповіт улюбленої бабусі, має на меті зібрати тисячу поцілунків, але не звичайних, а особливих, таких, коли серце мало не вистрибуватиме з грудей. Саме такі поцілунки обіцяє їй подарувати Рун. Історія кохання, яка розіб’є вам серце.",
            imageResId = R.drawable.book5,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 6,
            title = "Хірург",
            author = "Тесс Ґеррітсен",
            genre = "Жахи",
            price = 663.0,
            description = "Він приходить лише у ночі. Безшумно проникає у дім. Крадеться до спальні, де тільки но прокинувшись від сну, самотні жінки потрапляють до приголомшливого кошмару. Зважаючи на те, що він робить зі своїми жертвами, можна припустити, що злодій знається на медицині. Саме через це його називають Хірург. Томас Мур та Джейн Ріццолі розслідують серію страшенних вбивств. Злочинець наслідує почерк серійного маніяка, якого було вбито два роки тому. Він копією навіть такі дрібні деталі, про які мало кому відомо. Остання з жертв загиблого маніяка Кетрін Корделл, вбила його, та саме через це стає метою нового вбивці. Із кожною наступною жертвою невідомий наближається до Кетрін. Саме Томасу та Джейн доведеться зупинити геніального вбивцю, чого б це не коштувало.",
            imageResId = R.drawable.book6,
            isFavorite = false,
            isInCart = false,
            inStock = false
        )
    )

    val currentUser = User(
        id = 1,
        name = "Anastasiia",
        email = "anastasiia@email.com",
        password = "1111"
    )
}