package com.kp.projectbookstore.data

import com.kp.projectbookstore.R
import com.kp.projectbookstore.models.Book
import com.kp.projectbookstore.models.User

object TestData {

    val books = mutableListOf(
        Book(
            id = 1,
            title = "Воно",
            author = "Стівен Кінг",
            genre = "Жахи",
            price = 926.0,
            description = "Колись давно семеро підлітків лицем до лиця зіткнулися із невимовним Жахом — і змогли перемогти. Але багато років по тому істота, що не має імені, повертається, щоб помститися... Воно наче випірнуло з нічних кошмарів. Воно живиться страхом і ненавистю. Воно причаїлося всюди... Старі друзі мусять зустрітися з Ним і знову зазирнути у вічі справжньому жаху...",
            imageResId = R.drawable.book1,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 2,
            title = "Дюна",
            author = "Френк Герберт",
            genre = "Фантастика",
            price = 1020.0,
            description = "Меланж, або прянощі, — найцінніша і найрідкісніша речовина у всесвіті, яка може все: від подовження життя до сприяння міжзоряним подорожам. І знайти її можна лише на одній планеті — непривітному пустельному Арракісі. Той, хто володарює на Арракісі, контролює прянощі. А хто контролює прянощі — керує всесвітом. Коли Імператор позбавляє клан Харконненів звання правлячого і віддає цей титул Атрідам, Харконнени вбивають герцога Лето Атріда. Його син Пол і наложниця Джессіка тікають у пустелю. Щоб помститися за батька і відвоювати планету в Харконненів, Пол має здобути довіру фрименів — корінних мешканців Арракіса — і повести крихітну армію проти незліченних сил супротивника.",
            imageResId = R.drawable.book2,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 3,
            title = "Виживуть п'ятеро",
            author = "Голлі Джексон",
            genre = "Жахи",
            price = 1003.0,
            description = "Захопливий роман неперевершеної майстрині трилерів! На весняні канікули шестеро друзів вирушають на відпочинок у фургоні, який взяли напрокат. І наче все чудово і весело… хіба що кілька разів випадково звернули не туди… Та коли друзі розуміють, що застрягли десь у глушині без сигналу GPS і мобільного зв’язку, уже не так весело… А коли хтось прострілює їм усі шини та бензобак, стає зрозуміло — це геть не випадковість. Десь назовні в темряві за ними спостерігає убивця. А в когось у цьому фургоні є секрет, що вартує життя…",
            imageResId = R.drawable.book3,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 4,
            title = "Маленькі жінки",
            author = "Луїза Мей Олкот",
            genre = "Роман",
            price = 443.0,
            description = "«Маленькі жінки» — це захоплива історія чотирьох дівчат, рідних сестер, але абсолютно різних особистостей. Кожна з них має неповторний характер та інтереси. Під час Громадянської війни родина небагатого провінційного пастора Марча переживає складний період, очікуючи на повернення батька з фронту. Дівчата стають одна для одної надійною опорою у важкі часи. Сестри, попри війну, переживають радості, прикрощі та перше кохання. Вони продовжують дорослішати і вчаться цінувати справжні почуття, дружбу, сім'ю та любов.",
            imageResId = R.drawable.book4,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 5,
            title = "Тисяча пам'ятних поцілунків",
            author = "Тіллі Коул",
            genre = "Роман",
            price = 449.0,
            description = "Чи може кохання тривати вічно, попри перешкоди, відстань і час? Це можливо, якщо поєднуються дві половинки одного серця. Руну п’ять, він із батьками щойно переїхав із рідної Норвегії до маленького містечка американського штату Джорджія і дуже засмучений через це. Та відколи він знайомиться з дивакуватою сусідкою Поппі, його життя набуває яскравих кольорів і перетворюється на справжню пригоду. Поппі, виконуючи заповіт улюбленої бабусі, має на меті зібрати тисячу поцілунків, але не звичайних, а особливих, таких, коли серце мало не вистрибуватиме з грудей. Саме такі поцілунки обіцяє їй подарувати Рун. Історія кохання, яка розіб’є вам серце.",
            imageResId = R.drawable.book5,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 6,
            title = "Хірург",
            author = "Тесс Ґеррітсен",
            genre = "Жахи",
            price = 663.0,
            description = "Він приходить лише у ночі. Безшумно проникає у дім. Крадеться до спальні, де тільки но прокинувшись від сну, самотні жінки потрапляють до приголомшливого кошмару. Зважаючи на те, що він робить зі своїми жертвами, можна припустити, що злодій знається на медицині. Саме через це його називають Хірург. Томас Мур та Джейн Ріццолі розслідують серію страшенних вбивств. Злочинець наслідує почерк серійного маніяка, якого було вбито два роки тому. Він копією навіть такі дрібні деталі, про які мало кому відомо. Остання з жертв загиблого маніяка Кетрін Корделл, вбила його, та саме через це стає метою нового вбивці. Із кожною наступною жертвою невідомий наближається до Кетрін. Саме Томасу та Джейн доведеться зупинити геніального вбивцю, чого б це не коштувало.",
            imageResId = R.drawable.book6,
            isFavorite = false,
            isInCart = false,
            inStock = false
        ),
        Book(
            id = 7,
            title = "Я бачу, вас цікавить пітьма",
            author = "Ілларіон Павлюк",
            genre = "Проза",
            price = 831.0,
            description = "Київського кримінального психолога Андрія Гайстера відправляють консультантом у богом забуте селище Буськів Сад. Зимової ночі там зникла маленька дівчинка. А ще там водиться Звір — серійний маніяк, убивств якого тамтешні мешканці воліють не помічати... У цьому проклятому селищі, де все по колу і всі живуть життям, яке ненавидять, розслідування постійно заходить у глухий кут. Андрій вірить, що загублена дівчинка, попри все, жива і він її знайде. Але нікому, крім нього, це не потрібно.«Я бачу, вас цікавить пітьма» — історія про непробивну людську байдужість і пітьму всередині нас. Про чесність із собою й ціну, яку ми готові заплатити за забуття. Про гріхи, що матеріалізуються, і спокуту, дорожчу за спокій.",
            imageResId = R.drawable.book7,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 8,
            title = "Стіни в моїй голові",
            author = "Володимир Станчишин",
            genre = "Психологія",
            price = 636.0,
            description = "Уявіть, що на вас чекає побачення вашої мрії, але ви — не надто впевнена в собі людина. Ви знаєте, що ваш партнер або партнерка — вершина всіх ваших мрій, тож маєте бути в найкращій за все своє життя формі. Чи тривожить вас ця ситуація? Якщо ні, закривайте цю книжку й купіть порадник «Як навчитися не брехати. Якщо так, вітаємо в клубі тривожних пацієнтів. Книжку Володимира Станчишина «Стіни в моїй голові» присвячено тривожності, депресії, соціальним фобіям, різним психічним розладам, які більшою чи меншою мірою впливають на звичний спосіб життя людини в соціумі. Вона не вилікує вас від неприємних станів, але допоможе зрозуміти — жити з ними можливо. Усі ми, стверджує автор, є тривожними, і в цьому немає нічого надзвичайного. Головне — зрозуміти, що тривога супроводжує нас усе життя й відіграє свою важливу роль у нашому існуванні.",
            imageResId = R.drawable.book8,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 9,
            title = "Повернення Рейчел Прайс",
            author = "Голлі Джексон",
            genre = "Жахи",
            price = 956.0,
            description = "Шістнадцять років тому Рейчел Прайс зникла. Наче випарувалась, залишивши дворічну дочку Бел в автівці на узбіччі. Рейчел давно вважають загиблою, проте соцмережі ніяк не можуть вгомонитися, і зниклу нібито помічають то у Франції, то в Бразилії, навіть десь поблизу — у Нью-Гемпширі. І родині Прайсів пропонують взяти участь у зйомках документального фільму про ті події. Хай як Бел неприємна перспектива копирсання в минулому, вона пообіцяла батькові, тож мусить якось усе це перетерпіти, поки життя знов не стане нормальним.І тут несподівано Рейчел Прайс з’являється. І життя вже ніколи не стане нормальним. Історія Рейчел неймовірна. Та чи правдива? Поки камери працюють, Бел мусить це з’ясувати.",
            imageResId = R.drawable.book9,
            isFavorite = false,
            isInCart = false,
            inStock = true
        ),
        Book(
            id = 10,
            title = "Незавершений рукопис",
            author = "Франк Тільє",
            genre = "Жахи",
            price = 721.0,
            description = "Рукопис без фіналу, труп без обличчя, запитання без відповідей. На околицях Гренобля сталася дорожня аварія: юнак, утікаючи від митників, урізався в балюстраду і загинув. Поліціянти, приїхавши на місце пригоди, виявили в багажнику тіло дівчини. Без обличчя і рук. Тим часом Леана Морган, скромна вчителька, яка стала королевою трилера, через чотири роки після зникнення її дочки, отримує телефонний дзвінок. Її чоловік Жуліан у лікарні з травмою голови: на нього напали. Ба більше, він утратив пам’ять. Він, хто не кидав пошуків і до останнього вірив, що Сара жива. Леані доведеться самотужки розплутувати клубок зловісних загадок.",
            imageResId = R.drawable.book10,
            isFavorite = false,
            isInCart = false,
            inStock = true
        )
    )

    val users = listOf (
        User (
            id = 1,
            name = "Anastasiia",
            email = "anastasiia@email.com",
            password = "1111"
        ),
        User (
            id = 2,
            name = "User",
            email = "user@email.com",
            password = "1234"
        )
    )
}

